yeti/app/controllers/favorite_authors_controller.rb

  def update
    begin
      FavoriteAuthor.find(params[:id]).update(object_params)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "favorite_authors".* FROM "favorite_authors" WHERE "favorite_authors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "favorite_authors" SET "notes" = ?, "updated_at" = ? WHERE "favorite_authors"."id" = ?  [["notes", "Bush has hand enc"], ["updated_at", "2020-07-18 11:58:50.935573"], ["id", 3]]