yeti/app/controllers/favorite_books_controller.rb

  def update
    begin
      FavoriteBook.find(params[:id]).update(object_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "favorite_books".* FROM "favorite_books" WHERE "favorite_books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "favorite_books" SET "notes" = ?, "updated_at" = ? WHERE "favorite_books"."id" = ?  [["notes", "2134sdfg"], ["updated_at", "2020-07-20 21:34:26.210944"], ["id", 1]]