yeti/app/controllers/favorite_genres_controller.rb

SELECT "favorite_genres".* FROM "favorite_genres" WHERE "favorite_genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "favorite_genres" SET "notes" = ?, "updated_at" = ? WHERE "favorite_genres"."id" = ?  [["notes", "sdfgfj"], ["updated_at", "2020-07-20 21:38:52.464699"], ["id", 1]]
---
  def update
    begin
      FavoriteGenre.find(params[:id]).update(object_params)