yeti/app/controllers/sessions_controller.rb

  def do_login
    @user = User.find_by(name: params[:name_or_email])
    if @user.nil?
      @user = User.find_by(email: params[:name_or_email])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Jax Snow"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]