yeti/app/helpers/users_helper.rb

  def favorite_authors(user)
    authors = user.authors

    unless authors.empty?
      html = <<-HTML
        <fieldset>
          <legend>Favorite Authors (#{self.send('link_to', 'View All', user_authors_path(user))}</legend>
      HTML

      authors.each do |author|
---
SELECT 1 AS one FROM "authors" INNER JOIN "favorite_authors" ON "authors"."id" = "favorite_authors"."author_id" WHERE "favorite_authors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" INNER JOIN "favorite_authors" ON "authors"."id" = "favorite_authors"."author_id" WHERE "favorite_authors"."user_id" = ?  [["user_id", 2]]

  def favorite_books(user)
    books = user.books

    unless books.empty?
      html = <<-HTML
        <fieldset>
          <legend>Favorite Books (#{self.send('link_to', 'View All', user_books_path(user))})</legend>
      HTML

      books.each do |book|
---
SELECT "books".* FROM "books" INNER JOIN "favorite_books" ON "books"."id" = "favorite_books"."book_id" WHERE "favorite_books"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "books" INNER JOIN "favorite_books" ON "books"."id" = "favorite_books"."book_id" WHERE "favorite_books"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  def favorite_genres(user)
    genres = user.genres

    unless genres.empty?
      html = <<-HTML
        <fieldset>
          <legend>Favorite Genres (#{self.send('link_to', 'View All', user_genres_path(user))})</legend>
      HTML

      genres.each do |genre|
---
SELECT "genres".* FROM "genres" INNER JOIN "favorite_genres" ON "genres"."id" = "favorite_genres"."genre_id" WHERE "favorite_genres"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "genres" INNER JOIN "favorite_genres" ON "genres"."id" = "favorite_genres"."genre_id" WHERE "favorite_genres"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]