yeti/app/models/author.rb

  def self.popular
    self.joins(:favorite_authors).group(:name).order(count_name: :desc).order(name: :asc).count(:name)
---
SELECT COUNT("authors"."name") AS count_name, "authors"."name" AS authors_name FROM "authors" INNER JOIN "favorite_authors" ON "favorite_authors"."author_id" = "authors"."id" GROUP BY "authors"."name" ORDER BY "count_name" DESC, "authors"."name" ASC