yeti/app/models/book.rb

SELECT COUNT("books"."title") AS count_title, "books"."title" AS books_title FROM "books" INNER JOIN "favorite_books" ON "favorite_books"."book_id" = "books"."id" GROUP BY "books"."title" ORDER BY "count_title" DESC, "books"."title" ASC
---
  def self.popular
    self.joins(:favorite_books).group(:title).order(count_title: :desc).order(title: :asc).count(:title)