yeti/app/models/genre.rb

  def self.popular
    self.joins(:favorite_genres).group(:name).order(count_name: :desc).order(name: :asc).count(:name)
---
SELECT COUNT("genres"."name") AS count_name, "genres"."name" AS genres_name FROM "genres" INNER JOIN "favorite_genres" ON "favorite_genres"."genre_id" = "genres"."id" GROUP BY "genres"."name" ORDER BY "count_name" DESC, "genres"."name" ASC