yeti/app/models/user.rb

  def fav_authors(author)
    self.favorite_authors.where(author_id: author.id).first
---
SELECT "favorite_authors".* FROM "favorite_authors" WHERE "favorite_authors"."user_id" = ? AND "favorite_authors"."author_id" = ? ORDER BY "favorite_authors"."id" ASC LIMIT ?  [["user_id", 1], ["author_id", 5], ["LIMIT", 1]]

  def fav_books(book)
    fb = self.favorite_books.where(book_id: book.id).first
---
SELECT "favorite_books".* FROM "favorite_books" WHERE "favorite_books"."user_id" = ? AND "favorite_books"."book_id" = ? ORDER BY "favorite_books"."id" ASC LIMIT ?  [["user_id", 1], ["book_id", 10], ["LIMIT", 1]]

  def fav_genres(genre)
    self.favorite_genres.where(genre_id: genre.id).first
---
SELECT "favorite_genres".* FROM "favorite_genres" WHERE "favorite_genres"."user_id" = ? AND "favorite_genres"."genre_id" = ? ORDER BY "favorite_genres"."id" ASC LIMIT ?  [["user_id", 1], ["genre_id", 2], ["LIMIT", 1]]